window.N3_KANJI_READINGS = {
  "駐": {
    "on": [
      "チュウ"
    ],
    "kun": []
  },
  "無": {
    "on": [
      "ム",
      "ブ"
    ],
    "kun": [
      "な.い"
    ]
  },
  "満": {
    "on": [
      "マン",
      "バン"
    ],
    "kun": [
      "み.ちる",
      "み.つ",
      "み.たす"
    ]
  },
  "向": {
    "on": [
      "コウ"
    ],
    "kun": [
      "む.く",
      "む.い",
      "-む.き",
      "む.ける",
      "-む.け",
      "む.かう",
      "む.かい",
      "む.こう",
      "む.こう-",
      "むこ",
      "むか.い"
    ]
  },
  "禁": {
    "on": [
      "キン"
    ],
    "kun": []
  },
  "関": {
    "on": [
      "カン"
    ],
    "kun": [
      "せき",
      "-ぜき",
      "かか.わる",
      "からくり",
      "かんぬき"
    ]
  },
  "係": {
    "on": [
      "ケイ"
    ],
    "kun": [
      "かか.る",
      "かかり",
      "-がかり",
      "かか.わる"
    ]
  },
  "断": {
    "on": [
      "ダン"
    ],
    "kun": [
      "た.つ",
      "ことわ.る",
      "さだ.める"
    ]
  },
  "横": {
    "on": [
      "オウ"
    ],
    "kun": [
      "よこ"
    ]
  },
  "押": {
    "on": [
      "オウ"
    ],
    "kun": [
      "お.す",
      "お.し-",
      "お.っ-",
      "お.さえる",
      "おさ.える"
    ]
  },
  "式": {
    "on": [
      "シキ"
    ],
    "kun": []
  },
  "信": {
    "on": [
      "シン"
    ],
    "kun": []
  },
  "号": {
    "on": [
      "ゴウ"
    ],
    "kun": [
      "さけ.ぶ",
      "よびな"
    ]
  },
  "確": {
    "on": [
      "カク",
      "コウ"
    ],
    "kun": [
      "たし.か",
      "たし.かめる"
    ]
  },
  "認": {
    "on": [
      "ニン"
    ],
    "kun": [
      "みと.める",
      "したた.める"
    ]
  },
  "飛": {
    "on": [
      "ヒ"
    ],
    "kun": [
      "と.ぶ",
      "と.ばす",
      "-と.ばす"
    ]
  },
  "非": {
    "on": [
      "ヒ"
    ],
    "kun": [
      "あら.ず"
    ]
  },
  "常": {
    "on": [
      "ジョウ"
    ],
    "kun": [
      "つね",
      "とこ-"
    ]
  },
  "階": {
    "on": [
      "カイ"
    ],
    "kun": [
      "きざはし"
    ]
  },
  "段": {
    "on": [
      "ダン",
      "タン"
    ],
    "kun": []
  },
  "箱": {
    "on": [
      "ソウ"
    ],
    "kun": [
      "はこ"
    ]
  },
  "危": {
    "on": [
      "キ"
    ],
    "kun": [
      "あぶ.ない",
      "あや.うい",
      "あや.ぶむ"
    ]
  },
  "険": {
    "on": [
      "ケン"
    ],
    "kun": [
      "けわ.しい"
    ]
  },
  "捨": {
    "on": [
      "シャ"
    ],
    "kun": [
      "す.てる"
    ]
  },
  "線": {
    "on": [
      "セン"
    ],
    "kun": [
      "すじ"
    ]
  },
  "面": {
    "on": [
      "メン",
      "ベン"
    ],
    "kun": [
      "おも",
      "おもて",
      "つら"
    ]
  },
  "普": {
    "on": [
      "フ"
    ],
    "kun": [
      "あまね.く",
      "あまねし"
    ]
  },
  "各": {
    "on": [
      "カク"
    ],
    "kun": [
      "おのおの"
    ]
  },
  "次": {
    "on": [
      "ジ",
      "シ"
    ],
    "kun": [
      "つ.ぐ",
      "つぎ"
    ]
  },
  "快": {
    "on": [
      "カイ"
    ],
    "kun": [
      "こころよ.い"
    ]
  },
  "速": {
    "on": [
      "ソク"
    ],
    "kun": [
      "はや.い",
      "はや-",
      "はや.める",
      "すみ.やか"
    ]
  },
  "過": {
    "on": [
      "カ"
    ],
    "kun": [
      "す.ぎる",
      "す.ごす",
      "あやま.ち",
      "あやま.つ",
      "よぎ.る",
      "よ.ぎる"
    ]
  },
  "鉄": {
    "on": [
      "テツ"
    ],
    "kun": [
      "くろがね"
    ]
  },
  "指": {
    "on": [
      "シ"
    ],
    "kun": [
      "ゆび",
      "さ.す",
      "-さ.し"
    ]
  },
  "定": {
    "on": [
      "テイ",
      "ジョウ"
    ],
    "kun": [
      "さだ.める",
      "さだ.まる",
      "さだ.か"
    ]
  },
  "席": {
    "on": [
      "セキ"
    ],
    "kun": [
      "むしろ"
    ]
  },
  "由": {
    "on": [
      "ユ",
      "ユウ",
      "ユイ"
    ],
    "kun": [
      "よし",
      "よ.る"
    ]
  },
  "番": {
    "on": [
      "バン"
    ],
    "kun": [
      "つが.い"
    ]
  },
  "窓": {
    "on": [
      "ソウ",
      "ス"
    ],
    "kun": [
      "まど",
      "てんまど",
      "けむだし"
    ]
  },
  "側": {
    "on": [
      "ソク"
    ],
    "kun": [
      "かわ",
      "がわ",
      "そば"
    ]
  },
  "路": {
    "on": [
      "ロ",
      "ル"
    ],
    "kun": [
      "-じ",
      "みち"
    ]
  },
  "停": {
    "on": [
      "テイ"
    ],
    "kun": [
      "と.める",
      "と.まる"
    ]
  },
  "整": {
    "on": [
      "セイ"
    ],
    "kun": [
      "ととの.える",
      "ととの.う"
    ]
  },
  "券": {
    "on": [
      "ケン"
    ],
    "kun": []
  },
  "現": {
    "on": [
      "ゲン"
    ],
    "kun": [
      "あらわ.れる",
      "あらわ.す",
      "うつつ",
      "うつ.つ"
    ]
  },
  "両": {
    "on": [
      "リョウ"
    ],
    "kun": [
      "てる",
      "ふたつ"
    ]
  },
  "替": {
    "on": [
      "タイ"
    ],
    "kun": [
      "か.える",
      "か.え-",
      "か.わる"
    ]
  },
  "優": {
    "on": [
      "ユウ",
      "ウ"
    ],
    "kun": [
      "やさ.しい",
      "すぐ.れる",
      "まさ.る"
    ]
  },
  "座": {
    "on": [
      "ザ"
    ],
    "kun": [
      "すわ.る"
    ]
  },
  "降": {
    "on": [
      "コウ",
      "ゴ"
    ],
    "kun": [
      "お.りる",
      "お.ろす",
      "ふ.る",
      "ふ.り",
      "くだ.る",
      "くだ.す"
    ]
  },
  "未": {
    "on": [
      "ミ",
      "ビ"
    ],
    "kun": [
      "いま.だ",
      "ま.だ",
      "ひつじ"
    ]
  },
  "末": {
    "on": [
      "マツ",
      "バツ"
    ],
    "kun": [
      "すえ",
      "うら",
      "うれ"
    ]
  },
  "若": {
    "on": [
      "ジャク",
      "ニャク",
      "ニャ"
    ],
    "kun": [
      "わか.い",
      "わか-",
      "も.しくわ",
      "も.し",
      "も.しくは",
      "ごと.し"
    ]
  },
  "晩": {
    "on": [
      "バン"
    ],
    "kun": []
  },
  "島": {
    "on": [
      "トウ"
    ],
    "kun": [
      "しま"
    ]
  },
  "皿": {
    "on": [
      "ベイ"
    ],
    "kun": [
      "さら"
    ]
  },
  "血": {
    "on": [
      "ケツ"
    ],
    "kun": [
      "ち"
    ]
  },
  "助": {
    "on": [
      "ジョ"
    ],
    "kun": [
      "たす.ける",
      "たす.かる",
      "す.ける",
      "すけ"
    ]
  },
  "準": {
    "on": [
      "ジュン"
    ],
    "kun": [
      "じゅん.じる",
      "じゅん.ずる",
      "なぞら.える",
      "のり",
      "ひと.しい",
      "みずもり"
    ]
  },
  "備": {
    "on": [
      "ビ"
    ],
    "kun": [
      "そな.える",
      "そな.わる",
      "つぶさ.に"
    ]
  },
  "営": {
    "on": [
      "エイ"
    ],
    "kun": [
      "いとな.む",
      "いとな.み"
    ]
  },
  "閉": {
    "on": [
      "ヘイ"
    ],
    "kun": [
      "と.じる",
      "と.ざす",
      "し.める",
      "し.まる",
      "た.てる"
    ]
  },
  "案": {
    "on": [
      "アン"
    ],
    "kun": [
      "つくえ"
    ]
  },
  "内": {
    "on": [
      "ナイ",
      "ダイ"
    ],
    "kun": [
      "うち"
    ]
  },
  "予": {
    "on": [
      "ヨ",
      "シャ"
    ],
    "kun": [
      "あらかじ.め"
    ]
  },
  "約": {
    "on": [
      "ヤク"
    ],
    "kun": [
      "つづ.まる",
      "つづ.める",
      "つづま.やか"
    ]
  },
  "煙": {
    "on": [
      "エン"
    ],
    "kun": [
      "けむ.る",
      "けむり",
      "けむ.い"
    ]
  },
  "当": {
    "on": [
      "トウ"
    ],
    "kun": [
      "あ.たる",
      "あ.たり",
      "あ.てる",
      "あ.て",
      "まさ.に",
      "まさ.にべし"
    ]
  },
  "全": {
    "on": [
      "ゼン"
    ],
    "kun": [
      "まった.く",
      "すべ.て"
    ]
  },
  "客": {
    "on": [
      "キャク",
      "カク"
    ],
    "kun": []
  },
  "様": {
    "on": [
      "ヨウ",
      "ショウ"
    ],
    "kun": [
      "さま",
      "さん"
    ]
  },
  "解": {
    "on": [
      "カイ",
      "ゲ"
    ],
    "kun": [
      "と.く",
      "と.かす",
      "と.ける",
      "ほど.く",
      "ほぐ.す",
      "わか.る",
      "さと.る"
    ]
  },
  "協": {
    "on": [
      "キョウ"
    ],
    "kun": []
  },
  "願": {
    "on": [
      "ガン"
    ],
    "kun": [
      "ねが.う",
      "-ねがい"
    ]
  },
  "観": {
    "on": [
      "カン"
    ],
    "kun": [
      "み.る",
      "しめ.す"
    ]
  },
  "園": {
    "on": [
      "エン"
    ],
    "kun": [
      "その"
    ]
  },
  "港": {
    "on": [
      "コウ"
    ],
    "kun": [
      "みなと"
    ]
  },
  "遊": {
    "on": [
      "ユウ",
      "ユ"
    ],
    "kun": [
      "あそ.ぶ",
      "あそ.ばす"
    ]
  },
  "美": {
    "on": [
      "ビ",
      "ミ"
    ],
    "kun": [
      "うつく.しい"
    ]
  },
  "術": {
    "on": [
      "ジュツ"
    ],
    "kun": [
      "すべ"
    ]
  },
  "神": {
    "on": [
      "シン",
      "ジン"
    ],
    "kun": [
      "かみ",
      "かん-",
      "こう-"
    ]
  },
  "寺": {
    "on": [
      "ジ"
    ],
    "kun": [
      "てら"
    ]
  },
  "役": {
    "on": [
      "ヤク",
      "エキ"
    ],
    "kun": []
  },
  "郵": {
    "on": [
      "ユウ"
    ],
    "kun": []
  },
  "局": {
    "on": [
      "キョク"
    ],
    "kun": [
      "つぼね"
    ]
  },
  "交": {
    "on": [
      "コウ"
    ],
    "kun": [
      "まじ.わる",
      "まじ.える",
      "ま.じる",
      "まじ.る",
      "ま.ざる",
      "ま.ぜる",
      "-か.う",
      "か.わす",
      "かわ.す",
      "こもごも"
    ]
  },
  "差": {
    "on": [
      "サ"
    ],
    "kun": [
      "さ.す",
      "さ.し"
    ]
  },
  "点": {
    "on": [
      "テン"
    ],
    "kun": [
      "つ.ける",
      "つ.く",
      "た.てる",
      "さ.す",
      "とぼ.す",
      "とも.す",
      "ぼち"
    ]
  },
  "橋": {
    "on": [
      "キョウ"
    ],
    "kun": [
      "はし"
    ]
  },
  "公": {
    "on": [
      "コウ",
      "ク"
    ],
    "kun": [
      "おおやけ"
    ]
  },
  "受": {
    "on": [
      "ジュ"
    ],
    "kun": [
      "う.ける",
      "-う.け",
      "う.かる"
    ]
  },
  "付": {
    "on": [
      "フ"
    ],
    "kun": [
      "つ.ける",
      "-つ.ける",
      "-づ.ける",
      "つ.け",
      "つ.け-",
      "-つ.け",
      "-づ.け",
      "-づけ",
      "つ.く",
      "-づ.く",
      "つ.き",
      "-つ.き",
      "-つき",
      "-づ.き",
      "-づき"
    ]
  },
  "科": {
    "on": [
      "カ"
    ],
    "kun": []
  },
  "鼻": {
    "on": [
      "ビ"
    ],
    "kun": [
      "はな"
    ]
  },
  "婦": {
    "on": [
      "フ"
    ],
    "kun": [
      "よめ"
    ]
  },
  "形": {
    "on": [
      "ケイ",
      "ギョウ"
    ],
    "kun": [
      "かた",
      "-がた",
      "かたち",
      "なり"
    ]
  },
  "骨": {
    "on": [
      "コツ"
    ],
    "kun": [
      "ほね"
    ]
  },
  "折": {
    "on": [
      "セツ",
      "シャク"
    ],
    "kun": [
      "お.る",
      "おり",
      "お.り",
      "-お.り",
      "お.れる"
    ]
  },
  "困": {
    "on": [
      "コン"
    ],
    "kun": [
      "こま.る"
    ]
  },
  "消": {
    "on": [
      "ショウ"
    ],
    "kun": [
      "き.える",
      "け.す"
    ]
  },
  "防": {
    "on": [
      "ボウ"
    ],
    "kun": [
      "ふせ.ぐ"
    ]
  },
  "救": {
    "on": [
      "キュウ"
    ],
    "kun": [
      "すく.う"
    ]
  },
  "警": {
    "on": [
      "ケイ"
    ],
    "kun": [
      "いまし.める"
    ]
  },
  "察": {
    "on": [
      "サツ"
    ],
    "kun": []
  },
  "故": {
    "on": [
      "コ"
    ],
    "kun": [
      "ゆえ",
      "ふる.い",
      "もと"
    ]
  },
  "伝": {
    "on": [
      "デン",
      "テン"
    ],
    "kun": [
      "つた.わる",
      "つた.える",
      "つた.う",
      "つだ.う",
      "-づた.い",
      "つて"
    ]
  },
  "黄": {
    "on": [
      "コウ",
      "オウ"
    ],
    "kun": [
      "き",
      "こ-"
    ]
  },
  "絵": {
    "on": [
      "カイ",
      "エ"
    ],
    "kun": []
  },
  "組": {
    "on": [
      "ソ"
    ],
    "kun": [
      "く.む",
      "くみ",
      "-ぐみ"
    ]
  },
  "束": {
    "on": [
      "ソク"
    ],
    "kun": [
      "たば",
      "たば.ねる",
      "つか",
      "つか.ねる"
    ]
  },
  "授": {
    "on": [
      "ジュ"
    ],
    "kun": [
      "さず.ける",
      "さず.かる"
    ]
  },
  "渡": {
    "on": [
      "ト"
    ],
    "kun": [
      "わた.る",
      "-わた.る",
      "わた.す"
    ]
  },
  "昔": {
    "on": [
      "セキ",
      "シャク"
    ],
    "kun": [
      "むかし"
    ]
  },
  "要": {
    "on": [
      "ヨウ"
    ],
    "kun": [
      "い.る",
      "かなめ"
    ]
  },
  "冷": {
    "on": [
      "レイ"
    ],
    "kun": [
      "つめ.たい",
      "ひ.える",
      "ひ.や",
      "ひ.ややか",
      "ひ.やす",
      "ひ.やかす",
      "さ.める",
      "さ.ます"
    ]
  },
  "蔵": {
    "on": [
      "ゾウ",
      "ソウ"
    ],
    "kun": [
      "くら",
      "おさ.める",
      "かく.れる"
    ]
  },
  "凍": {
    "on": [
      "トウ"
    ],
    "kun": [
      "こお.る",
      "こご.える",
      "こご.る",
      "い.てる",
      "し.みる"
    ]
  },
  "庫": {
    "on": [
      "コ",
      "ク"
    ],
    "kun": [
      "くら"
    ]
  },
  "召": {
    "on": [
      "ショウ"
    ],
    "kun": [
      "め.す"
    ]
  },
  "保": {
    "on": [
      "ホ",
      "ホウ"
    ],
    "kun": [
      "たも.つ"
    ]
  },
  "存": {
    "on": [
      "ソン",
      "ゾン"
    ],
    "kun": [
      "ながら.える",
      "あ.る",
      "たも.つ",
      "と.う"
    ]
  },
  "必": {
    "on": [
      "ヒツ"
    ],
    "kun": [
      "かなら.ず"
    ]
  },
  "費": {
    "on": [
      "ヒ"
    ],
    "kun": [
      "つい.やす",
      "つい.える"
    ]
  },
  "期": {
    "on": [
      "キ",
      "ゴ"
    ],
    "kun": []
  },
  "限": {
    "on": [
      "ゲン"
    ],
    "kun": [
      "かぎ.る",
      "かぎ.り",
      "-かぎ.り"
    ]
  },
  "製": {
    "on": [
      "セイ"
    ],
    "kun": []
  },
  "造": {
    "on": [
      "ゾウ"
    ],
    "kun": [
      "つく.る",
      "つく.り",
      "-づく.り"
    ]
  },
  "賞": {
    "on": [
      "ショウ"
    ],
    "kun": [
      "ほ.める"
    ]
  },
  "法": {
    "on": [
      "ホウ",
      "ハッ",
      "ホッ",
      "フラン"
    ],
    "kun": [
      "のり"
    ]
  },
  "温": {
    "on": [
      "オン"
    ],
    "kun": [
      "あたた.か",
      "あたた.かい",
      "あたた.まる",
      "あたた.める",
      "ぬく"
    ]
  },
  "販": {
    "on": [
      "ハン"
    ],
    "kun": []
  },
  "機": {
    "on": [
      "キ"
    ],
    "kun": [
      "はた"
    ]
  },
  "増": {
    "on": [
      "ゾウ"
    ],
    "kun": [
      "ま.す",
      "ま.し",
      "ふ.える",
      "ふ.やす"
    ]
  },
  "減": {
    "on": [
      "ゲン"
    ],
    "kun": [
      "へ.る",
      "へ.らす"
    ]
  },
  "量": {
    "on": [
      "リョウ"
    ],
    "kun": [
      "はか.る"
    ]
  },
  "氷": {
    "on": [
      "ヒョウ"
    ],
    "kun": [
      "こおり",
      "ひ",
      "こお.る"
    ]
  },
  "返": {
    "on": [
      "ヘン"
    ],
    "kun": [
      "かえ.す",
      "-かえ.す",
      "かえ.る",
      "-かえ.る"
    ]
  },
  "湯": {
    "on": [
      "トウ"
    ],
    "kun": [
      "ゆ"
    ]
  },
  "材": {
    "on": [
      "ザイ"
    ],
    "kun": []
  },
  "卵": {
    "on": [
      "ラン"
    ],
    "kun": [
      "たまご"
    ]
  },
  "乳": {
    "on": [
      "ニュウ"
    ],
    "kun": [
      "ちち",
      "ち"
    ]
  },
  "粉": {
    "on": [
      "フン"
    ],
    "kun": [
      "デシメートル",
      "こ",
      "こな"
    ]
  },
  "袋": {
    "on": [
      "タイ",
      "ダイ"
    ],
    "kun": [
      "ふくろ"
    ]
  },
  "混": {
    "on": [
      "コン"
    ],
    "kun": [
      "ま.じる",
      "-ま.じり",
      "ま.ざる",
      "ま.ぜる",
      "こ.む"
    ]
  },
  "焼": {
    "on": [
      "ショウ"
    ],
    "kun": [
      "や.く",
      "や.き",
      "や.き-",
      "-や.き",
      "や.ける"
    ]
  },
  "表": {
    "on": [
      "ヒョウ"
    ],
    "kun": [
      "おもて",
      "-おもて",
      "あらわ.す",
      "あらわ.れる",
      "あら.わす"
    ]
  },
  "裏": {
    "on": [
      "リ"
    ],
    "kun": [
      "うら"
    ]
  },
  "留": {
    "on": [
      "リュウ",
      "ル"
    ],
    "kun": [
      "と.める",
      "と.まる",
      "とど.める",
      "とど.まる",
      "るうぶる"
    ]
  },
  "守": {
    "on": [
      "シュ",
      "ス"
    ],
    "kun": [
      "まも.る",
      "まも.り",
      "もり",
      "-もり",
      "かみ"
    ]
  },
  "濃": {
    "on": [
      "ノウ"
    ],
    "kun": [
      "こ.い"
    ]
  },
  "薄": {
    "on": [
      "ハク"
    ],
    "kun": [
      "うす.い",
      "うす-",
      "-うす",
      "うす.める",
      "うす.まる",
      "うす.らぐ",
      "うす.ら-",
      "うす.れる",
      "すすき"
    ]
  },
  "部": {
    "on": [
      "ブ"
    ],
    "kun": [
      "-べ"
    ]
  },
  "数": {
    "on": [
      "スウ",
      "ス",
      "サク",
      "ソク",
      "シュ"
    ],
    "kun": [
      "かず",
      "かぞ.える",
      "しばしば",
      "せ.める",
      "わずらわ.しい"
    ]
  },
  "件": {
    "on": [
      "ケン"
    ],
    "kun": [
      "くだん"
    ]
  },
  "再": {
    "on": [
      "サイ",
      "サ"
    ],
    "kun": [
      "ふたた.び"
    ]
  },
  "接": {
    "on": [
      "セツ",
      "ショウ"
    ],
    "kun": [
      "つ.ぐ"
    ]
  },
  "続": {
    "on": [
      "ゾク",
      "ショク",
      "コウ",
      "キョウ"
    ],
    "kun": [
      "つづ.く",
      "つづ.ける",
      "つぐ.ない"
    ]
  },
  "示": {
    "on": [
      "ジ",
      "シ"
    ],
    "kun": [
      "しめ.す"
    ]
  },
  "戻": {
    "on": [
      "レイ"
    ],
    "kun": [
      "もど.す",
      "もど.る"
    ]
  },
  "完": {
    "on": [
      "カン"
    ],
    "kun": []
  },
  "了": {
    "on": [
      "リョウ"
    ],
    "kun": []
  },
  "登": {
    "on": [
      "トウ",
      "ト",
      "ドウ",
      "ショウ",
      "チョウ"
    ],
    "kun": [
      "のぼ.る",
      "あ.がる"
    ]
  },
  "録": {
    "on": [
      "ロク"
    ],
    "kun": [
      "しる.す",
      "と.る"
    ]
  },
  "育": {
    "on": [
      "イク"
    ],
    "kun": [
      "そだ.つ",
      "そだ.ち",
      "そだ.てる",
      "はぐく.む"
    ]
  },
  "種": {
    "on": [
      "シュ"
    ],
    "kun": [
      "たね",
      "-ぐさ"
    ]
  },
  "類": {
    "on": [
      "ルイ"
    ],
    "kun": [
      "たぐ.い"
    ]
  },
  "師": {
    "on": [
      "シ"
    ],
    "kun": [
      "いくさ"
    ]
  },
  "妻": {
    "on": [
      "サイ"
    ],
    "kun": [
      "つま"
    ]
  },
  "馬": {
    "on": [
      "バ"
    ],
    "kun": [
      "うま",
      "うま-",
      "ま"
    ]
  },
  "石": {
    "on": [
      "セキ",
      "シャク",
      "コク"
    ],
    "kun": [
      "いし"
    ]
  },
  "砂": {
    "on": [
      "サ",
      "シャ"
    ],
    "kun": [
      "すな"
    ]
  },
  "塩": {
    "on": [
      "エン"
    ],
    "kun": [
      "しお"
    ]
  },
  "油": {
    "on": [
      "ユ",
      "ユウ"
    ],
    "kun": [
      "あぶら"
    ]
  },
  "緑": {
    "on": [
      "リョク",
      "ロク"
    ],
    "kun": [
      "みどり"
    ]
  },
  "紅": {
    "on": [
      "コウ",
      "ク"
    ],
    "kun": [
      "べに",
      "くれない",
      "あか.い"
    ]
  },
  "冊": {
    "on": [
      "サツ",
      "サク"
    ],
    "kun": [
      "ふみ"
    ]
  },
  "個": {
    "on": [
      "コ",
      "カ"
    ],
    "kun": []
  },
  "枚": {
    "on": [
      "マイ",
      "バイ"
    ],
    "kun": []
  },
  "告": {
    "on": [
      "コク"
    ],
    "kun": [
      "つ.げる"
    ]
  },
  "利": {
    "on": [
      "リ"
    ],
    "kun": [
      "き.く"
    ]
  },
  "割": {
    "on": [
      "カツ"
    ],
    "kun": [
      "わ.る",
      "わり",
      "わ.り",
      "わ.れる",
      "さ.く"
    ]
  },
  "倍": {
    "on": [
      "バイ"
    ],
    "kun": []
  },
  "値": {
    "on": [
      "チ"
    ],
    "kun": [
      "ね",
      "あたい"
    ]
  },
  "商": {
    "on": [
      "ショウ"
    ],
    "kun": [
      "あきな.う"
    ]
  },
  "支": {
    "on": [
      "シ"
    ],
    "kun": [
      "ささ.える",
      "つか.える",
      "か.う"
    ]
  },
  "払": {
    "on": [
      "フツ",
      "ヒツ",
      "ホツ"
    ],
    "kun": [
      "はら.う",
      "-はら.い",
      "-ばら.い"
    ]
  },
  "米": {
    "on": [
      "ベイ",
      "マイ",
      "メエトル"
    ],
    "kun": [
      "こめ",
      "よね"
    ]
  },
  "級": {
    "on": [
      "キュウ"
    ],
    "kun": []
  },
  "残": {
    "on": [
      "ザン",
      "サン"
    ],
    "kun": [
      "のこ.る",
      "のこ.す",
      "そこな.う",
      "のこ.り"
    ]
  },
  "型": {
    "on": [
      "ケイ"
    ],
    "kun": [
      "かた",
      "-がた"
    ]
  },
  "税": {
    "on": [
      "ゼイ"
    ],
    "kun": []
  },
  "込": {
    "on": [],
    "kun": [
      "-こ.む",
      "こ.む",
      "こ.み",
      "-こ.み",
      "こ.める"
    ]
  },
  "価": {
    "on": [
      "カ",
      "ケ"
    ],
    "kun": [
      "あたい"
    ]
  },
  "格": {
    "on": [
      "カク",
      "コウ",
      "キャク",
      "ゴウ"
    ],
    "kun": []
  },
  "申": {
    "on": [
      "シン"
    ],
    "kun": [
      "もう.す",
      "もう.し-",
      "さる"
    ]
  },
  "記": {
    "on": [
      "キ"
    ],
    "kun": [
      "しる.す"
    ]
  },
  "例": {
    "on": [
      "レイ"
    ],
    "kun": [
      "たと.える"
    ]
  },
  "齢": {
    "on": [
      "レイ"
    ],
    "kun": [
      "よわい",
      "とし"
    ]
  },
  "歳": {
    "on": [
      "サイ",
      "セイ"
    ],
    "kun": [
      "とし",
      "とせ",
      "よわい"
    ]
  },
  "性": {
    "on": [
      "セイ",
      "ショウ"
    ],
    "kun": [
      "さが"
    ]
  },
  "連": {
    "on": [
      "レン"
    ],
    "kun": [
      "つら.なる",
      "つら.ねる",
      "つ.れる",
      "-づ.れ"
    ]
  },
  "絡": {
    "on": [
      "ラク"
    ],
    "kun": [
      "から.む",
      "から.まる"
    ]
  },
  "届": {
    "on": [
      "カイ"
    ],
    "kun": [
      "とど.ける",
      "-とど.け",
      "とど.く"
    ]
  },
  "宅": {
    "on": [
      "タク"
    ],
    "kun": []
  },
  "配": {
    "on": [
      "ハイ"
    ],
    "kun": [
      "くば.る"
    ]
  },
  "希": {
    "on": [
      "キ",
      "ケ"
    ],
    "kun": [
      "まれ",
      "こいねが.う"
    ]
  },
  "望": {
    "on": [
      "ボウ",
      "モウ"
    ],
    "kun": [
      "のぞ.む",
      "もち"
    ]
  },
  "荷": {
    "on": [
      "カ"
    ],
    "kun": [
      "に"
    ]
  },
  "換": {
    "on": [
      "カン"
    ],
    "kun": [
      "か.える",
      "-か.える",
      "か.わる"
    ]
  },
  "額": {
    "on": [
      "ガク"
    ],
    "kun": [
      "ひたい"
    ]
  },
  "在": {
    "on": [
      "ザイ"
    ],
    "kun": [
      "あ.る"
    ]
  },
  "取": {
    "on": [
      "シュ"
    ],
    "kun": [
      "と.る",
      "と.り",
      "と.り-",
      "とり",
      "-ど.り"
    ]
  },
  "預": {
    "on": [
      "ヨ"
    ],
    "kun": [
      "あず.ける",
      "あず.かる"
    ]
  },
  "衣": {
    "on": [
      "イ",
      "エ"
    ],
    "kun": [
      "ころも",
      "きぬ",
      "-ぎ"
    ]
  },
  "参": {
    "on": [
      "サン",
      "シン"
    ],
    "kun": [
      "まい.る",
      "まい-",
      "まじわる",
      "みつ"
    ]
  },
  "達": {
    "on": [
      "タツ",
      "ダ"
    ],
    "kun": [
      "-たち"
    ]
  },
  "勤": {
    "on": [
      "キン",
      "ゴン"
    ],
    "kun": [
      "つと.める",
      "-づと.め",
      "つと.まる",
      "いそ.しむ"
    ]
  },
  "帯": {
    "on": [
      "タイ"
    ],
    "kun": [
      "お.びる",
      "おび"
    ]
  },
  "細": {
    "on": [
      "サイ"
    ],
    "kun": [
      "ほそ.い",
      "ほそ.る",
      "こま.か",
      "こま.かい"
    ]
  },
  "戸": {
    "on": [
      "コ"
    ],
    "kun": [
      "と"
    ]
  },
  "湖": {
    "on": [
      "コ"
    ],
    "kun": [
      "みずうみ"
    ]
  },
  "船": {
    "on": [
      "セン"
    ],
    "kun": [
      "ふね",
      "ふな-"
    ]
  },
  "角": {
    "on": [
      "カク"
    ],
    "kun": [
      "かど",
      "つの"
    ]
  },
  "夫": {
    "on": [
      "フ",
      "フウ",
      "ブ"
    ],
    "kun": [
      "おっと",
      "それ"
    ]
  },
  "苦": {
    "on": [
      "ク"
    ],
    "kun": [
      "くる.しい",
      "-ぐる.しい",
      "くる.しむ",
      "くる.しめる",
      "にが.い",
      "にが.る"
    ]
  },
  "礼": {
    "on": [
      "レイ",
      "ライ"
    ],
    "kun": []
  },
  "伺": {
    "on": [
      "シ"
    ],
    "kun": [
      "うかが.う"
    ]
  },
  "遅": {
    "on": [
      "チ"
    ],
    "kun": [
      "おく.れる",
      "おく.らす",
      "おそ.い"
    ]
  },
  "失": {
    "on": [
      "シツ"
    ],
    "kun": [
      "うしな.う",
      "う.せる"
    ]
  },
  "汗": {
    "on": [
      "カン"
    ],
    "kun": [
      "あせ"
    ]
  },
  "念": {
    "on": [
      "ネン"
    ],
    "kun": []
  },
  "涙": {
    "on": [
      "ルイ",
      "レイ"
    ],
    "kun": [
      "なみだ"
    ]
  },
  "笑": {
    "on": [
      "ショウ"
    ],
    "kun": [
      "わら.う",
      "え.む"
    ]
  },
  "調": {
    "on": [
      "チョウ"
    ],
    "kun": [
      "しら.べる",
      "しら.べ",
      "ととの.う",
      "ととの.える"
    ]
  },
  "査": {
    "on": [
      "サ"
    ],
    "kun": []
  },
  "移": {
    "on": [
      "イ"
    ],
    "kun": [
      "うつ.る",
      "うつ.す"
    ]
  },
  "難": {
    "on": [
      "ナン"
    ],
    "kun": [
      "かた.い",
      "-がた.い",
      "むずか.しい",
      "むづか.しい",
      "むつか.しい",
      "-にく.い"
    ]
  },
  "簡": {
    "on": [
      "カン",
      "ケン"
    ],
    "kun": [
      "えら.ぶ",
      "ふだ"
    ]
  },
  "単": {
    "on": [
      "タン"
    ],
    "kun": [
      "ひとえ"
    ]
  },
  "感": {
    "on": [
      "カン"
    ],
    "kun": []
  },
  "想": {
    "on": [
      "ソウ",
      "ソ"
    ],
    "kun": [
      "おも.う"
    ]
  },
  "練": {
    "on": [
      "レン"
    ],
    "kun": [
      "ね.る",
      "ね.り"
    ]
  },
  "最": {
    "on": [
      "サイ",
      "シュ"
    ],
    "kun": [
      "もっと.も",
      "つま"
    ]
  },
  "適": {
    "on": [
      "テキ"
    ],
    "kun": [
      "かな.う"
    ]
  },
  "選": {
    "on": [
      "セン"
    ],
    "kun": [
      "えら.ぶ",
      "え.る",
      "よ.る"
    ]
  },
  "違": {
    "on": [
      "イ"
    ],
    "kun": [
      "ちが.う",
      "ちが.い",
      "ちが.える",
      "-ちが.える",
      "たが.う",
      "たが.える"
    ]
  },
  "直": {
    "on": [
      "チョク",
      "ジキ",
      "ジカ"
    ],
    "kun": [
      "ただ.ちに",
      "なお.す",
      "-なお.す",
      "なお.る",
      "なお.き",
      "す.ぐ"
    ]
  },
  "復": {
    "on": [
      "フク"
    ],
    "kun": [
      "また"
    ]
  },
  "辞": {
    "on": [
      "ジ"
    ],
    "kun": [
      "や.める",
      "いな.む"
    ]
  },
  "宿": {
    "on": [
      "シュク"
    ],
    "kun": [
      "やど",
      "やど.る",
      "やど.す"
    ]
  },
  "昨": {
    "on": [
      "サク"
    ],
    "kun": []
  },
  "君": {
    "on": [
      "クン"
    ],
    "kun": [
      "きみ",
      "-ぎみ"
    ]
  },
  "結": {
    "on": [
      "ケツ",
      "ケチ"
    ],
    "kun": [
      "むす.ぶ",
      "ゆ.う",
      "ゆ.わえる"
    ]
  },
  "婚": {
    "on": [
      "コン"
    ],
    "kun": []
  },
  "祝": {
    "on": [
      "シュク",
      "シュウ"
    ],
    "kun": [
      "いわ.う"
    ]
  },
  "曲": {
    "on": [
      "キョク"
    ],
    "kun": [
      "ま.がる",
      "ま.げる",
      "くま"
    ]
  },
  "奥": {
    "on": [
      "オウ"
    ],
    "kun": [
      "おく",
      "おく.まる",
      "くま"
    ]
  },
  "寝": {
    "on": [
      "シン"
    ],
    "kun": [
      "ね.る",
      "ね.かす",
      "い.ぬ",
      "みたまや",
      "や.める"
    ]
  },
  "痛": {
    "on": [
      "ツウ"
    ],
    "kun": [
      "いた.い",
      "いた.む",
      "いた.ましい",
      "いた.める"
    ]
  },
  "熱": {
    "on": [
      "ネツ"
    ],
    "kun": [
      "あつ.い"
    ]
  },
  "虫": {
    "on": [
      "チュウ",
      "キ"
    ],
    "kun": [
      "むし"
    ]
  },
  "歯": {
    "on": [
      "シ"
    ],
    "kun": [
      "よわい",
      "は",
      "よわ.い",
      "よわい.する"
    ]
  },
  "治": {
    "on": [
      "ジ",
      "チ"
    ],
    "kun": [
      "おさ.める",
      "おさ.まる",
      "なお.る",
      "なお.す"
    ]
  },
  "汚": {
    "on": [
      "オ"
    ],
    "kun": [
      "けが.す",
      "けが.れる",
      "けが.らわしい",
      "よご.す",
      "よご.れる",
      "きたな.い"
    ]
  },
  "並": {
    "on": [
      "ヘイ",
      "ホウ"
    ],
    "kun": [
      "な.み",
      "なみ",
      "なら.べる",
      "なら.ぶ",
      "なら.びに"
    ]
  },
  "他": {
    "on": [
      "タ"
    ],
    "kun": [
      "ほか"
    ]
  },
  "身": {
    "on": [
      "シン"
    ],
    "kun": [
      "み"
    ]
  },
  "酒": {
    "on": [
      "シュ"
    ],
    "kun": [
      "さけ",
      "さか-"
    ]
  },
  "吸": {
    "on": [
      "キュウ"
    ],
    "kun": [
      "す.う"
    ]
  },
  "欲": {
    "on": [
      "ヨク"
    ],
    "kun": [
      "ほっ.する",
      "ほ.しい"
    ]
  },
  "眠": {
    "on": [
      "ミン"
    ],
    "kun": [
      "ねむ.る",
      "ねむ.い"
    ]
  },
  "疲": {
    "on": [
      "ヒ"
    ],
    "kun": [
      "つか.れる",
      "-づか.れ",
      "つか.らす"
    ]
  },
  "息": {
    "on": [
      "ソク"
    ],
    "kun": [
      "いき"
    ]
  },
  "呼": {
    "on": [
      "コ"
    ],
    "kun": [
      "よ.ぶ"
    ]
  },
  "厚": {
    "on": [
      "コウ"
    ],
    "kun": [
      "あつ.い",
      "あか"
    ]
  },
  "泣": {
    "on": [
      "キュウ"
    ],
    "kun": [
      "な.く"
    ]
  },
  "鳴": {
    "on": [
      "メイ"
    ],
    "kun": [
      "な.く",
      "な.る",
      "な.らす"
    ]
  },
  "初": {
    "on": [
      "ショ"
    ],
    "kun": [
      "はじ.め",
      "はじ.めて",
      "はつ",
      "はつ-",
      "うい-",
      "-そ.める",
      "-ぞ.め"
    ]
  },
  "泊": {
    "on": [
      "ハク"
    ],
    "kun": [
      "と.まる",
      "と.める"
    ]
  },
  "葉": {
    "on": [
      "ヨウ"
    ],
    "kun": [
      "は"
    ]
  },
  "報": {
    "on": [
      "ホウ"
    ],
    "kun": [
      "むく.いる"
    ]
  },
  "晴": {
    "on": [
      "セイ"
    ],
    "kun": [
      "は.れる",
      "は.れ",
      "は.れ-",
      "-ば.れ",
      "は.らす"
    ]
  },
  "雲": {
    "on": [
      "ウン"
    ],
    "kun": [
      "くも",
      "-ぐも"
    ]
  },
  "吹": {
    "on": [
      "スイ"
    ],
    "kun": [
      "ふ.く"
    ]
  },
  "暖": {
    "on": [
      "ダン",
      "ノン"
    ],
    "kun": [
      "あたた.か",
      "あたた.かい",
      "あたた.まる",
      "あたた.める"
    ]
  },
  "雪": {
    "on": [
      "セツ"
    ],
    "kun": [
      "ゆき"
    ]
  },
  "震": {
    "on": [
      "シン"
    ],
    "kun": [
      "ふる.う",
      "ふる.える",
      "ふる.わせる",
      "ふる.わす"
    ]
  },
  "波": {
    "on": [
      "ハ"
    ],
    "kun": [
      "なみ"
    ]
  },
  "求": {
    "on": [
      "キュウ",
      "グ"
    ],
    "kun": [
      "もと.める"
    ]
  },
  "募": {
    "on": [
      "ボ"
    ],
    "kun": [
      "つの.る"
    ]
  },
  "職": {
    "on": [
      "ショク",
      "ソク"
    ],
    "kun": []
  },
  "容": {
    "on": [
      "ヨウ"
    ],
    "kun": [
      "い.れる"
    ]
  },
  "技": {
    "on": [
      "ギ"
    ],
    "kun": [
      "わざ"
    ]
  },
  "般": {
    "on": [
      "ハン"
    ],
    "kun": []
  },
  "務": {
    "on": [
      "ム"
    ],
    "kun": [
      "つと.める"
    ]
  },
  "課": {
    "on": [
      "カ"
    ],
    "kun": []
  },
  "球": {
    "on": [
      "キュウ"
    ],
    "kun": [
      "たま"
    ]
  },
  "決": {
    "on": [
      "ケツ"
    ],
    "kun": [
      "き.める",
      "-ぎ.め",
      "き.まる",
      "さ.く"
    ]
  },
  "勝": {
    "on": [
      "ショウ"
    ],
    "kun": [
      "か.つ",
      "-が.ち",
      "まさ.る",
      "すぐ.れる",
      "かつ"
    ]
  },
  "対": {
    "on": [
      "タイ",
      "ツイ"
    ],
    "kun": [
      "あいて",
      "こた.える",
      "そろ.い",
      "つれあ.い",
      "なら.ぶ",
      "むか.う"
    ]
  },
  "流": {
    "on": [
      "リュウ",
      "ル"
    ],
    "kun": [
      "なが.れる",
      "なが.れ",
      "なが.す",
      "-なが.す"
    ]
  },
  "負": {
    "on": [
      "フ"
    ],
    "kun": [
      "ま.ける",
      "ま.かす",
      "お.う"
    ]
  },
  "投": {
    "on": [
      "トウ"
    ],
    "kun": [
      "な.げる",
      "-な.げ"
    ]
  },
  "果": {
    "on": [
      "カ"
    ],
    "kun": [
      "は.たす",
      "はた.す",
      "-は.たす",
      "は.てる",
      "-は.てる",
      "は.て"
    ]
  },
  "戦": {
    "on": [
      "セン"
    ],
    "kun": [
      "いくさ",
      "たたか.う",
      "おのの.く",
      "そよ.ぐ",
      "わなな.く"
    ]
  },
  "経": {
    "on": [
      "ケイ",
      "キョウ",
      "キン"
    ],
    "kun": [
      "へ.る",
      "た.つ",
      "たていと",
      "はか.る",
      "のり"
    ]
  },
  "済": {
    "on": [
      "サイ",
      "セイ"
    ],
    "kun": [
      "す.む",
      "-ず.み",
      "-ずみ",
      "す.まない",
      "す.ます",
      "-す.ます",
      "すく.う",
      "な.す",
      "わたし",
      "わた.る"
    ]
  },
  "成": {
    "on": [
      "セイ",
      "ジョウ"
    ],
    "kun": [
      "な.る",
      "な.す",
      "-な.す"
    ]
  },
  "貿": {
    "on": [
      "ボウ"
    ],
    "kun": []
  },
  "易": {
    "on": [
      "エキ",
      "イ"
    ],
    "kun": [
      "やさ.しい",
      "やす.い"
    ]
  },
  "輸": {
    "on": [
      "ユ",
      "シュ"
    ],
    "kun": []
  },
  "相": {
    "on": [
      "ソウ",
      "ショウ"
    ],
    "kun": [
      "あい-"
    ]
  },
  "化": {
    "on": [
      "カ",
      "ケ"
    ],
    "kun": [
      "ば.ける",
      "ば.かす",
      "ふ.ける",
      "け.する"
    ]
  },
  "比": {
    "on": [
      "ヒ"
    ],
    "kun": [
      "くら.べる"
    ]
  },
  "原": {
    "on": [
      "ゲン"
    ],
    "kun": [
      "はら"
    ]
  },
  "因": {
    "on": [
      "イン"
    ],
    "kun": [
      "よ.る",
      "ちな.む"
    ]
  },
  "際": {
    "on": [
      "サイ"
    ],
    "kun": [
      "きわ",
      "-ぎわ"
    ]
  },
  "議": {
    "on": [
      "ギ"
    ],
    "kun": []
  },
  "活": {
    "on": [
      "カツ"
    ],
    "kun": [
      "い.きる",
      "い.かす",
      "い.ける"
    ]
  },
  "変": {
    "on": [
      "ヘン"
    ],
    "kun": [
      "か.わる",
      "か.わり",
      "か.える"
    ]
  },
  "政": {
    "on": [
      "セイ",
      "ショウ"
    ],
    "kun": [
      "まつりごと",
      "まん"
    ]
  },
  "府": {
    "on": [
      "フ"
    ],
    "kun": []
  },
  "改": {
    "on": [
      "カイ"
    ],
    "kun": [
      "あらた.める",
      "あらた.まる"
    ]
  },
  "否": {
    "on": [
      "ヒ"
    ],
    "kun": [
      "いな",
      "いや"
    ]
  },
  "的": {
    "on": [
      "テキ"
    ],
    "kun": [
      "まと"
    ]
  },
  "実": {
    "on": [
      "ジツ",
      "シツ"
    ],
    "kun": [
      "み",
      "みの.る",
      "まこと",
      "みの",
      "みち.る"
    ]
  },
  "欠": {
    "on": [
      "ケツ",
      "ケン"
    ],
    "kun": [
      "か.ける",
      "か.く"
    ]
  },
  "専": {
    "on": [
      "セン"
    ],
    "kun": [
      "もっぱ.ら"
    ]
  },
  "亡": {
    "on": [
      "ボウ",
      "モウ"
    ],
    "kun": [
      "な.い",
      "な.き-",
      "ほろ.びる",
      "ほろ.ぶ",
      "ほろ.ぼす"
    ]
  },
  "忙": {
    "on": [
      "ボウ",
      "モウ"
    ],
    "kun": [
      "いそが.しい",
      "せわ.しい",
      "おそ.れる",
      "うれえるさま"
    ]
  },
  "忘": {
    "on": [
      "ボウ"
    ],
    "kun": [
      "わす.れる"
    ]
  },
  "祭": {
    "on": [
      "サイ"
    ],
    "kun": [
      "まつ.る",
      "まつ.り",
      "まつり"
    ]
  },
  "労": {
    "on": [
      "ロウ"
    ],
    "kun": [
      "ろう.する",
      "いたわ.る",
      "いた.ずき",
      "ねぎら",
      "つか.れる",
      "ねぎら.う"
    ]
  },
  "加": {
    "on": [
      "カ"
    ],
    "kun": [
      "くわ.える",
      "くわ.わる"
    ]
  },
  "情": {
    "on": [
      "ジョウ",
      "セイ"
    ],
    "kun": [
      "なさ.け"
    ]
  },
  "反": {
    "on": [
      "ハン",
      "ホン",
      "タン",
      "ホ"
    ],
    "kun": [
      "そ.る",
      "そ.らす",
      "かえ.す",
      "かえ.る",
      "-かえ.る"
    ]
  }
};
